but if i try to add rules to the ressouce i have a another problem after : 

here i add a rules to allow in more http service : 

```hcl
data "nutanix_service_groups_v2" "service_group_shared_service_dns_az1"{
  provider = nutanix.az1
    filter = "name eq 'SharedService-DNS'"
}

data "nutanix_service_groups_v2" "service_group_shared_service_http_az1"{
  provider = nutanix.az1
    filter = "name eq 'http'"
}

data "nutanix_service_groups_v2" "service_group_shared_service_https_az1"{
  provider = nutanix.az1
    filter = "name eq 'https'"
}

data "nutanix_subnets_v2" "shared_subnet_vlan10_ncp_internet_01_az1"{
  provider            = nutanix.az1
  filter = "name eq 'shared_subnet_vlan10_ncp_internet_01'"
}

resource "nutanix_category_v2" "alm_vpc_02_category_dns_server_value_az1" {
  provider = nutanix.az1
  key         = "alm_vpc_02_category"
  value       = "dns_server_value"
}

resource "nutanix_category_v2" "alm_vpc_02_category_web_server_value_az1" {
  provider = nutanix.az1
  key         = "alm_vpc_02_category"
  value       = "web_server_value"
}

resource "nutanix_vpc_v2" "alm_vpc_02_az1" {
  provider = nutanix.az1  
  name        = "alm_vpc_02"
  description = "VPC for alm_vpc_02"
  external_subnets {
    active_gateway_count = 1
    subnet_reference = data.nutanix_subnets_v2.shared_subnet_vlan10_ncp_internet_01_az1.subnets[0].ext_id
    external_ips {
      ipv4 {
        value       = "192.168.1.10"
        prefix_length = 32
      }
    }
  } 
}

resource "nutanix_network_security_policy_v2" "alm_vpc_02_security_policy_01_az1" {
  provider            = nutanix.az1
  name                = "alm_vpc_02_security_policy_01"
  description         = "alm_vpc_02_security_policy_01"
  type                = "APPLICATION"
  state               = "ENFORCE"
  is_hitlog_enabled   = true
  scope = "VPC_LIST"
  vpc_reference      = [nutanix_vpc_v2.alm_vpc_02_az1.id]

  rules {
    description = "web server to dns server for dns service"
    type        = "APPLICATION"

    spec {
      application_rule_spec {
        src_category_references           = [nutanix_category_v2.alm_vpc_02_category_web_server_value_az1.id]
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_dns_server_value_az1.id]
        service_group_references          = [data.nutanix_service_groups_v2.service_group_shared_service_dns_az1.service_groups[0].ext_id]
      }
    }
  }  
  
  rules {
    description = "any to web server for https service"
    type        = "APPLICATION"

    spec {
      application_rule_spec {
		    src_allow_spec                    = "ALL"
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_web_server_value_az1.id]
        service_group_references          = [data.nutanix_service_groups_v2.service_group_shared_service_https_az1.service_groups[0].ext_id]
      }
    }
  }

rules {
    description = "any to web server for http service"
    type        = "APPLICATION"

    spec {
      application_rule_spec {
		    src_allow_spec                    = "ALL"
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_web_server_value_az1.id]
        service_group_references          = [data.nutanix_service_groups_v2.service_group_shared_service_http_az1.service_groups[0].ext_id]
      }
    }
  }

  rules {
    description = "Outbound default rule web_server"
    type        = "APPLICATION"

    spec {
      application_rule_spec {
        dest_allow_spec = "ALL"
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_web_server_value_az1.id]
        is_all_protocol_allowed = true
      }
    }
  }

  rules {
    description = "Intra Tiers default rule dns_server"
    type        = "INTRA_GROUP"

    spec {
      intra_entity_group_rule_spec {
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_dns_server_value_az1.id]
        secured_group_action = "ALLOW"
      }
    }
  }

  rules {
    description = "Intra Tiers default rule web_server"
    type        = "INTRA_GROUP"

    spec {
      intra_entity_group_rule_spec {
        secured_group_category_references = [nutanix_category_v2.alm_vpc_02_category_web_server_value_az1.id]
        secured_group_action = "ALLOW"
      }
    }
  }
}
```

we can see the change not correct because tofu modify existing rules and not just add the rules : 

```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # nutanix_network_security_policy_v2.alm_vpc_02_security_policy_01_az1 will be updated in-place
  ~ resource "nutanix_network_security_policy_v2" "alm_vpc_02_security_policy_01_az1" {
        id                      = "612d38e2-b62d-40ea-a514-0a1c8ee46432"
        name                    = "alm_vpc_02_security_policy_01"
        # (13 unchanged attributes hidden)

      ~ rules {
          ~ description = "Outbound default rule web_server" -> "any to web server for http service"
            # (2 unchanged attributes hidden)

          ~ spec {
              ~ application_rule_spec {
                  ~ service_group_references          = [
                      + "1851370b-fc5d-4374-93fb-6c5a8e1d34f1",
                    ]
                  + src_allow_spec                    = "ALL"
                    # (7 unchanged attributes hidden)
                }
            }
        }
      ~ rules {
          ~ description = "Intra Tiers default rule dns_server" -> "Outbound default rule web_server"
          ~ type        = "INTRA_GROUP" -> "APPLICATION"
            # (1 unchanged attribute hidden)

          ~ spec {
              + application_rule_spec {
                  + dest_address_group_references     = (known after apply)
                  + dest_allow_spec                   = "ALL"
                  + dest_category_references          = (known after apply)
                  + is_all_protocol_allowed           = true
                  + secured_group_category_references = [
                      + "bc9cdf63-3967-47e1-b58b-e663e3b3bf3a",
                    ]
                  + service_group_references          = (known after apply)
                  + src_address_group_references      = (known after apply)
                  + src_category_references           = (known after apply)

                  + dest_subnet (known after apply)

                  + src_subnet (known after apply)
                }

                # (1 unchanged block hidden)
            }
        }
      ~ rules {
          ~ description = "Intra Tiers default rule web_server" -> "Intra Tiers default rule dns_server"
            # (2 unchanged attributes hidden)

          ~ spec {
              ~ intra_entity_group_rule_spec {
                  ~ secured_group_category_references = [
                      - "bc9cdf63-3967-47e1-b58b-e663e3b3bf3a",
                      + "bc92726d-c666-4a67-9459-7666ac5441d1",
                    ]
                    # (1 unchanged attribute hidden)
                }
            }
        }
      + rules {
          + description = "Intra Tiers default rule web_server"
          + links       = (known after apply)
          + type        = "INTRA_GROUP"

          + spec {
              + intra_entity_group_rule_spec {
                  + secured_group_action              = "ALLOW"
                  + secured_group_category_references = [
                      + "bc9cdf63-3967-47e1-b58b-e663e3b3bf3a",
                    ]
                }
              + multi_env_isolation_rule_spec (known after apply)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

```

and the apply will not work : 

tofu apply
```
│ Error: error while updating network security: {"data":{"error":[{"$reserved":{"$fv":"v4.r1"},"$objectType":"microseg.v4.error.AppMessage","message":"Failed to update network security policy (policies) because Application rule has both Inbound and Outbound properties.","severity":"ERROR","code":"MIC-30108","locale":"en_US"}],"$reserved":{"$fv":"v4.r1"},"$objectType":"microseg.v4.error.ErrorResponse"},"$reserved":{"$fv":"v4.r1"},"$objectType":"microseg.v4.config.UpdateNetworkSecurityPolicyApiResponse","metadata":{"flags":[{"$reserved":{"$fv":"v1.r0"},"$objectType":"common.v1.config.Flag","name":"hasError","value":true},{"$reserved":{"$fv":"v1.r0"},"$objectType":"common.v1.config.Flag","name":"isPaginated","value":false},{"$reserved":{"$fv":"v1.r0"},"$objectType":"common.v1.config.Flag","name":"isTruncated","value":false}],"$reserved":{"$fv":"v1.r0"},"$objectType":"common.v1.response.ApiResponseMetadata","links":[{"$reserved":{"$fv":"v1.r0"},"$objectType":"common.v1.response.ApiLink","href":"http://100.0.0.0/api/microseg/v4/config/policies/612d38e2-b62d-40ea-a514-0a1c8ee46432","rel":"self"}],"totalAvailableResults":0}}
│ 
│   with nutanix_network_security_policy_v2.alm_vpc_02_security_policy_01_az1,
│   on alm_vpc_02.tf line 769, in resource "nutanix_network_security_policy_v2" "alm_vpc_02_security_policy_01_az1":
│  769: resource "nutanix_network_security_policy_v2" "alm_vpc_02_security_policy_01_az1" {
```
